Revit 2026 API

# UpdaterRegistry Class

---

An object that stores and manages all updaters registered in the current session.

SystemObject Autodesk.Revit.DBUpdaterRegistry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UpdaterRegistry : IDisposable
```
```vb
Public Class UpdaterRegistry
	Implements IDisposable
```
```cpp
public ref class UpdaterRegistry : IDisposable
```
```fsharp
type UpdaterRegistry =
    class
        interface IDisposable
    end
```

The UpdaterRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddTrigger(UpdaterId, ElementFilter, ChangeType) | Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater |
|  | AddTrigger(UpdaterId, Document, ElementFilter, ChangeType) | Adds trigger with the specified element filter and ChangeType for the specified document |
|  | AddTrigger(UpdaterId, Document, ICollectionElementId, ChangeType) |  |
|  | DisableUpdater | Disables the updater. |
|  | Dispose | Releases all resources used by the UpdaterRegistry |
|  | EnableUpdater | Enables the updater. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIsUpdaterOptional | Check if the updater is optional or not. |
|  | GetRegisteredUpdaterInfos | Returns UpdaterInfos for all the application-wide updaters. |
|  | GetRegisteredUpdaterInfos(Document) | Returns information about all updaters applicable to the given document. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsUpdaterEnabled | Checks if the updater is enabled or not. |
|  | IsUpdaterRegistered(UpdaterId) | Checks whether updater with the given id is registered |
|  | IsUpdaterRegistered(UpdaterId, Document) | Checks whether updater with the given id is registered in a document. |
|  | RegisterUpdater(IUpdater) | Registers an updater application-wide, which means the updater may get triggered in any open document. |
|  | RegisterUpdater(IUpdater, Document) | Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document. |
|  | RegisterUpdater(IUpdater, Boolean) | Registers an updater application-wide, which means the updater may get triggered in any open document. |
|  | RegisterUpdater(IUpdater, Document, Boolean) | Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document. |
|  | RemoveAllTriggers | Removes all triggers associated with Updater with specified UpdaterId. Does not unregister updater. |
|  | RemoveDocumentTriggers | Removes all triggers associated with specified document and Updater Does not unregister updater. |
|  | SetExecutionOrder | Forces execution order between two updaters Execution order: first before second |
|  | SetIsUpdaterOptional | Sets a flag indicating whether an updater is optional or not. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UnregisterUpdater(UpdaterId) | Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater. |
|  | UnregisterUpdater(UpdaterId, Document) | Unregisters an updater for the given document. |

The registry is an application-wide singleton. It maintains all dynamic updaters currently registered, and also invokes them per their respective trigger condition during subsequent transactions.

Please note that only the application (an add-in, typically) which registered an updater is allowed to modify it later, including unregistering it. Also, an application is not allowed to register an updater with an Id, that is based on another application's Id.

#### Reference

Autodesk.Revit.DB Namespace